Revit 2024 API
ExportPatternKey.OriginalFillPatternType Property
 The original FillPattern type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public FillPatternTarget OriginalFillPatternType { get; set; }
Visual Basic
Public Property OriginalFillPatternType As FillPatternTarget
	Get
	Set
Visual C++
public:
property FillPatternTarget OriginalFillPatternType {
	FillPatternTarget get ();
	void set (FillPatternTarget value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ExportPatternKey Class
Autodesk.Revit.DB Namespace